#+Title: Utvecklingsmilj칬n
#+Author: Mikael Svahnberg
#+Email: Mikael.Svahnberg@bth.se
#+Date: 2023-11-21
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: email:t <:t todo:t f:t ':t H:2
#+STARTUP: beamer

#+LATEX_CLASS_OPTIONS: [10pt,t,a4paper]
#+BEAMER_THEME: BTH_msv


* diff
#+begin_src bash :results output
cd /tmp
echo "aaa" > first.txt ; echo "aaa" > second.txt
echo "bbb" >> first.txt; echo "BBB" >> second.txt
echo "ccc" >> first.txt; echo "ccc" >> second.txt
echo "ddd" >> second.txt

diff first.txt second.txt
#+end_src

#+RESULTS:
: 2c2
: < bbb
: ---
: > BBB
: 3a4
: > ddd
** git status -- Var 칛r jag, vad beh칬ver g칬ras?
#+begin_src bash :session gitex :results output
echo "hello" > h.txt
echo "world" > w.txt
ls -l
cat *

git status # Kolla vad git anser om det vi har s친h칛r l친ngt
#+end_src

#+RESULTS:
#+begin_example
total 8
-rw-r--r-- 1 msv msv 6 28 nov 12.48 h.txt
-rw-r--r-- 1 msv msv 6 28 nov 12.48 w.txt
hello
world
On branch master

No commits yet

Untracked files:
  (use "git add <file>..." to include in what will be committed)
	h.txt
	w.txt

nothing added to commit but untracked files present (use "git add" to track)
#+end_example
** git add -- Skapa en Commit, steg 1: The staging area
- Staging area 칛r ett omr친de d칛r man kan "plocka ihop" allting som man vill skall h칛nga ihop i en commit
- Man kan g칬ra ganska komplexa saker h칛r (l칛gga till en del av en fil, t.ex.)
- oftast handlar det bara om att man skall v칛lja ut filerna.

#+begin_src bash :session gitex :results output
git add h.txt
git add w.txt
git rm --cached w.txt # Jag 친ngrade mig, den h칛r skall inte med 칛n.
# git add --all   # l칛gger till alla filer som inte 칛r tillagda 칛n.

git status
#+end_src

#+RESULTS:
#+begin_example
rm 'w.txt'
On branch master

No commits yet

Changes to be committed:
  (use "git rm --cached <file>..." to unstage)
	new file:   h.txt

Untracked files:
  (use "git add <file>..." to include in what will be committed)
	w.txt
#+end_example
** git commit -- Skapa en Commit, steg 2
- Nu 칛r vi redo att committa allt som vi har i v친r staging area.

#+begin_src bash :session gitex :results output
git commit -m "Finally"
git status
#+end_src

#+RESULTS:
: [master (root-commit) 5e95b81] Finally
:  1 file changed, 1 insertion(+)
:  create mode 100644 h.txt
: On branch master
: Untracked files:
:   (use "git add <file>..." to include in what will be committed)
: 	w.txt
: 
: nothing added to commit but untracked files present (use "git add" to track)
** git log -- Kolla Loggen
#+begin_src bash :results output
cd /tmp/ms
git log --all | cat -
# git log --all --graph --abbrev-commit --decorate --oneline | cat -
#+end_src

#+RESULTS:
#+begin_example
commit 74aa928841ecaa76f43e2bcfe76421a1263e778f
Author: Mikael Svahnberg <msv@msv-mac.local>
Date:   Wed Mar 3 13:45:04 2021 +0100

    minor edit

commit 652e5e057f23e8c4e064a22976cb58fabea81a49
Author: Mikael Svahnberg <msv@msv-mac.local>
Date:   Wed Nov 11 10:37:18 2020 +0100

    Functional OO Programming text

commit 8abc530fc317392af51842c9f72c9550d71a63fc
Author: Mikael Svahnberg <msv@msv-mac.local>
Date:   Fri Oct 30 08:00:50 2020 +0100

    most of the scaffolding in place
#+end_example
